---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CircuitsOverlapDisconnectCircuits
source: html/deb53a0e-21d3-fa0c-6a08-155b7940b69e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CircuitsOverlapDisconnectCircuits Property

More than one circuit falls onto the same slot. These circuits will be disconnected.

## Syntax (C#)
```csharp
public static FailureDefinitionId CircuitsOverlapDisconnectCircuits { get; }
```